/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {}
    },
    "slideshow": {
      "type": "slideshow",
      "blocks": {
        "image_iMFaBC": {
          "type": "image",
          "settings": {
            "top_subheading": "",
            "title": "Founded with\na mission.",
            "title_size": 80,
            "subheading": "Featuring the latest textile technologies, independently tested.",
            "link": "",
            "link_text": "",
            "link_2": "",
            "link_text_2": "",
            "color_accent": "rgba(0,0,0,0)",
            "text_align": "vertical-center horizontal-center",
            "image": "shopify://shop_images/EnriqueOlivieriPhotography4_2_1.png",
            "parallax_direction": "top",
            "overlay_opacity": 0
          }
        }
      },
      "block_order": [
        "image_iMFaBC"
      ],
      "settings": {
        "section_height": "100vh",
        "mobile_height": "auto",
        "parallax": false,
        "style": "bars",
        "autoplay": false,
        "autoplay_speed": 7,
        "lazyload_images": false
      }
    },
    "rich-text": {
      "type": "rich-text",
      "blocks": {
        "text": {
          "type": "text",
          "settings": {
            "enlarge_text": true,
            "text": "<p>Founded in 1984 by designer Chantelle West, we've always believed in the power of locally made goods. The quality of the craftsmanship and the local artisans we employ are what make Luxette our mission in life.</p>"
          }
        }
      },
      "block_order": [
        "text"
      ],
      "settings": {
        "align_text": "center",
        "narrow_column": true,
        "divider": false
      }
    },
    "slideshow_CVE6Xp": {
      "type": "slideshow",
      "blocks": {
        "image_QnteFc": {
          "type": "image",
          "settings": {
            "top_subheading": "",
            "title": "",
            "title_size": 80,
            "subheading": "",
            "link": "",
            "link_text": "",
            "link_2": "",
            "link_text_2": "",
            "color_accent": "rgba(0,0,0,0)",
            "text_align": "vertical-center horizontal-center",
            "image": "shopify://shop_images/Screenshot_2025-02-11_at_17.54.25.png",
            "parallax_direction": "top",
            "overlay_opacity": 0
          }
        }
      },
      "block_order": [
        "image_QnteFc"
      ],
      "settings": {
        "section_height": "650px",
        "mobile_height": "auto",
        "parallax": false,
        "style": "bars",
        "autoplay": false,
        "autoplay_speed": 5,
        "lazyload_images": false
      }
    },
    "text-columns": {
      "type": "text-columns",
      "blocks": {
        "column1": {
          "type": "text_block",
          "settings": {
            "enable_image": true,
            "image": "shopify://shop_images/Rectangle_53.png",
            "image_mask": "none",
            "image_width": 650,
            "title": "jennifer maclellan",
            "text": "<p>CEO & Founder<br/>@jennifermaclellan</p>",
            "button_label": "",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "column1"
      ],
      "custom_css": [
        ".grid--flush-bottom {justify-content: center; display: flex;}"
      ],
      "settings": {
        "title": "Meet our founder",
        "align_text": "center",
        "divider": false
      }
    },
    "faq_6AxrnD": {
      "type": "faq",
      "blocks": {
        "question_h9mqXr": {
          "type": "question",
          "settings": {
            "title": "Whatinspired the creation of Toozi Sleepwear, and how does being a woman-owned,family business influence its design and craftsmanship?",
            "text": "<p>Toozi Sleepwear was born from a passion for crafting something truly special that elevates the sleepwear experience for everyone. We noticed that sleepwear often lacked purpose, so utilizing my experience in the fashion industry, I aimed to change that by designing sleepwear that allows individuals to sleep beautifully and look beautiful, just as they would when dressing for any other occasion. Our pieces are created with the intention of making you feel fabulous, even while you sleep, and we use premium bamboo fabrics to enhance that experience.<br/><br/>As a woman-owned and family-run brand, we bring a unique perspective to our design and operations. We prioritize both comfort and style, ensuring our sleepwear complements the diverse lifestyles of our customers. By fostering close relationships with our team and customers, we create a sense of community and trust that larger brands often overlook. This intimate connection drives us to operate Toozi Sleepwear with integrity and passion, always committed to delivering quality and satisfaction.</p>"
          }
        },
        "question_HRrBkw": {
          "type": "question",
          "settings": {
            "title": "How is Toozi Sleepwear crafted, and what are the key benefits of your fabrics?",
            "text": "<p>At Toozi, our sleepwear is crafted with love and care, reflecting the personal touch that defines our brand. I have had the privilege of visiting our talented team at StyleWorks, where our pieces are handmade. We are all directly involved in every step of the production process, from design to finishing touches, adding an intimate and thoughtful element to our creations.</p><p>We prioritize premium-quality fabrics that not only look luxurious but also enhance your comfort. One standout fabric is bamboo, known for its incredible softness, moisture-wicking properties, and natural hypoallergenic qualities. Choosing bamboo means you can sleep peacefully, knowing you're wrapped in both comfort and sustainability, making it the perfect choice for your nighttime routine.</p>"
          }
        },
        "question_VzCJN8": {
          "type": "question",
          "settings": {
            "title": "How does Toozi Sleepwear prioritize eco-friendly practices and ensure accessibility for all body types?",
            "text": "<p>We prioritize eco-friendly practices throughout our production process, from sourcing sustainable materials to working with manufacturers who share our commitment to minimizing waste. By investing in environmentally responsible fabrics, we aim to create a positive impact on our planet while delivering beautiful and beneficial sleepwear to our customers.<br/><br/>We believe that every woman deserves to feel beautiful, which is why we offer a diverse range of sizes to ensure that our sleepwear is accessible and inclusive for all body types. Our sizing chart is available on each product page, and we're continually working to expand our offerings to meet the needs of our customers.</p>"
          }
        },
        "question_FUXcpP": {
          "type": "question",
          "settings": {
            "title": "What makes Toozi Sleepwear special, and how does your background influence the brand's vision?",
            "text": "<p>Toozi is more than just a sleepwear brand; it's a celebration of modern chic aesthetics paired with unparalleled comfort. Our designs are minimalistic yet stylish, allowing you to feel confident and cozy in your own skin. The intimate nature of our small business means we connect with our customers on a personal level, creating a unique shopping experience.</p><p>My extensive experience in the media industry helps shape the vision for Toozi. Drawing from my years of highlighting fashion, beauty, and lifestyle, I understand what women want in their sleepwear-style that feels good and fits seamlessly into their lives. This expertise allows us to stay ahead of trends, ensuring our collections resonate with modern women. My passion for health and wellness further drives our commitment to creating sleepwear that enhances your lifestyle.</p>"
          }
        }
      },
      "block_order": [
        "question_h9mqXr",
        "question_HRrBkw",
        "question_VzCJN8",
        "question_FUXcpP"
      ],
      "settings": {
        "title": "MEET OUR FOUNDER"
      }
    },
    "featured-collection": {
      "type": "featured-collection",
      "settings": {
        "title": "Shop our products",
        "home_featured_products": "womens",
        "per_row": 4,
        "rows": 1,
        "mobile_scrollable": true,
        "view_all": false,
        "divider": false
      }
    },
    "form": {
      "type": "contact-form",
      "custom_css": [
        ".index-section {color: #b19f98;}",
        ".form-vertical .btn:not(:last-child) {background: #b19f98;}"
      ],
      "settings": {
        "title": "Questions? Send us an email",
        "text": "",
        "show_phone": false,
        "narrow_column": true
      }
    }
  },
  "order": [
    "main",
    "slideshow",
    "rich-text",
    "slideshow_CVE6Xp",
    "text-columns",
    "faq_6AxrnD",
    "featured-collection",
    "form"
  ]
}
